01  WS-AREA-1.                    PIC X(100). 
01  WS-AREA-2.                    PIC X(100). 
* Some other codes... 
MOVE WS-AREA-1 TO WS-AREA-2. 
* Some other codes...
MOVE SPACE TO WS-AREA-1(1:1). 